[Language]
Main_Title=感谢您使用 EaseUS Data Recovery Wizard
Sub_Title=请告诉我们您的总体感受
Terrible=很差
Poor=差
Good=一般
Great=很好
Excellent=非常棒
Never_Ask_Again=不再询问
Rate_Now=立即评价
Feedback_Text_Tips=请在此留下您宝贵的建议
Feedback_Length_Tips=您已经输入超过500个字了,如要反馈更多内容，请发送至support@easeus.com
